Import Libraly

In [29]:
import sqlite3 as sql
import pandas as pd

Connect to the database

In [30]:
c = sql.connect("northwind.db")

List all tables in the database

In [31]:
list_table = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", c)
list_table

                    name
0             Categories
1        sqlite_sequence
2   CustomerCustomerDemo
3   CustomerDemographics
4              Customers
5              Employees
6    EmployeeTerritories
7          Order Details
8                 Orders
9               Products
10               Regions
11              Shippers
12             Suppliers
13           Territories

1.Select all data from the table products and descriptive statistics for the products table

In [32]:
products = pd.read_sql_query("SELECT * FROM products", c)
products

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
72,73,Röd Kaviar,17,8,24 - 150 g jars,15.00,101,0,5,0
73,74,Longlife Tofu,4,7,5 kg pkg.,10.00,4,20,5,0
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,7.75,125,0,25,0
75,76,Lakkalikööri,23,1,500 ml,18.00,57,0,20,0
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00,32,0,15,0

In [33]:
products.describe()

,ProductID,SupplierID,CategoryID,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel
count,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000,77.000000
mean,39.000000,13.649351,4.116883,28.866364,40.506494,10.129870,12.467532
std,22.371857,8.220267,2.395028,33.815111,36.147222,23.141072,10.931105
min,1.000000,1.000000,1.000000,2.500000,0.000000,0.000000,0.000000
25%,20.000000,7.000000,2.000000,13.250000,15.000000,0.000000,0.000000
50%,39.000000,13.000000,4.000000,19.500000,26.000000,0.000000,10.000000
75%,58.000000,20.000000,6.000000,33.250000,61.000000,0.000000,25.000000
max,77.000000,29.000000,8.000000,263.500000,125.000000,100.000000,30.000000

2.Select all data from the table orders and descriptive statistics for the orders table

In [34]:
orders = pd.read_sql_query("SELECT * FROM orders", c)
orders

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,2018-05-05,2018-06-02,None,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,Central America,5033,Mexico
826,11074,SIMOB,7,2018-05-06,2018-06-03,None,2,18.44,Simons bistro,Vinbæltet 34,Kobenhavn,Northern Europe,1734,Denmark
827,11075,RICSU,8,2018-05-06,2018-06-03,None,2,6.19,Richter Supermarkt,Starenweg 5,Genève,Western Europe,1204,Switzerland
828,11076,BONAP,4,2018-05-06,2018-06-03,None,2,38.28,Bon app-,"12, rue des Bouchers",Marseille,Western Europe,13008,France
829,11077,RATTC,1,2018-05-06,2018-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,North America,87110,USA

In [35]:
orders.describe()

            OrderID  EmployeeID     ShipVia      Freight
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.007229    78.244205
std      239.744656    2.499648    0.779685   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

3.Select all data from the table order_details and descriptive statistics for the order_details table

In [36]:
order_details = pd.read_sql_query("SELECT * FROM `Order Details`", c)
order_details

      OrderID  ProductID  UnitPrice  Quantity  Discount
0       10248         11      14.00        12      0.00
1       10248         42       9.80        10      0.00
2       10248         72      34.80         5      0.00
3       10249         14      18.60         9      0.00
4       10249         51      42.40        40      0.00
...       ...        ...        ...       ...       ...
2150    11077         64      33.25         2      0.03
2151    11077         66      17.00         1      0.00
2152    11077         73      15.00         2      0.01
2153    11077         75       7.75         4      0.00
2154    11077         77      13.00         2      0.00

[2155 rows x 5 columns]

In [37]:
order_details.describe()

            OrderID    ProductID    UnitPrice     Quantity     Discount
count   2155.000000  2155.000000  2155.000000  2155.000000  2155.000000
mean   10659.375870    40.793039    26.218520    23.812993     0.056167
std      241.378032    22.159019    29.827418    19.022047     0.083450
min    10248.000000     1.000000     2.000000     1.000000     0.000000
25%    10451.000000    22.000000    12.000000    10.000000     0.000000
50%    10657.000000    41.000000    18.400000    20.000000     0.000000
75%    10862.500000    60.000000    32.000000    30.000000     0.100000
max    11077.000000    77.000000   263.500000   130.000000     0.250000

4.Select all data from the table categories and descriptive statistics for the categories table

In [38]:
categories = pd.read_sql_query("SELECT * FROM categories", c)
categories

,CategoryID,CategoryName,Description,Picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
2,3,Confections,"Desserts, candies, and sweet breads",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
3,4,Dairy Products,Cheeses,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
5,6,Meat/Poultry,Prepared meats,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
6,7,Produce,Dried fruit and bean curd,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
7,8,Seafood,Seaweed and fish,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...

In [39]:
categories.describe()

       CategoryID
count     8.00000
mean      4.50000
std       2.44949
min       1.00000
25%       2.75000
50%       4.50000
75%       6.25000
max       8.00000

5.Select all data from the table customers and descriptive statistics for the customers table

In [40]:
customers = pd.read_sql_query("SELECT * FROM customers", c)
customers

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,Western Europe,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,Central America,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,Central America,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,British Isles,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,Northern Europe,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
88,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,Scandinavia,90110,Finland,981-443655,981-443655
89,WELLI,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,South America,08737-363,Brazil,(14) 555-8122,None
90,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,North America,98128,USA,(206) 555-4112,(206) 555-4115
91,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,Scandinavia,21240,Finland,90-224 8858,90-224 8858
92,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,Eastern Europe,01-012,Poland,(26) 642-7012,(26) 642-7012

In [41]:
customers.describe()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
count,93,93,93,93,91,91,91,90,91,91,69
unique,93,92,93,13,91,69,9,86,21,91,69
top,ALFKI,IT,Maria Anders,Sales Representative,Obere Str. 57,London,Western Europe,1010,USA,030-0074321,030-0076545
freq,1,2,1,17,1,6,28,3,13,1,1

6.Select o.OrderID ,o.CustomerID, o.EmployeeID, o.OrderDate, o.ShipAddress, o.CompanyName, c.ContactName, c.Phone, c.Country from orders o inner join customers c on order.CustomerID = customers.CustomerID

In [42]:
order_customer = pd.read_sql_query("SELECT o.OrderID, o.CustomerID, o.EmployeeID, o.OrderDate, o.ShipAddress, c.CompanyName, c.ContactName, c.Phone, c.Country FROM orders o INNER JOIN customers c ON o.CustomerID = c.CustomerID;", c)
order_customer

,OrderID,CustomerID,EmployeeID,OrderDate,ShipAddress,CompanyName,ContactName,Phone,Country
0,10248,VINET,5,2016-07-04,59 rue de l-Abbaye,Vins et alcools Chevalier,Paul Henriot,26.47.15.10,France
1,10249,TOMSP,6,2016-07-05,Luisenstr. 48,Toms Spezialitäten,Karin Josephs,0251-031259,Germany
2,10250,HANAR,4,2016-07-08,"Rua do Paço, 67",Hanari Carnes,Mario Pontes,(21) 555-0091,Brazil
3,10251,VICTE,3,2016-07-08,"2, rue du Commerce",Victuailles en stock,Mary Saveley,78.32.54.86,France
4,10252,SUPRD,4,2016-07-09,"Boulevard Tirou, 255",Suprêmes délices,Pascale Cartrain,(071) 23 67 22 20,Belgium
...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,2018-05-05,Calle Dr. Jorge Cash 321,Pericles Comidas clásicas,Guillermo Fernández,(5) 552-3745,Mexico
826,11074,SIMOB,7,2018-05-06,Vinbæltet 34,Simons bistro,Jytte Petersen,31 12 34 56,Denmark
827,11075,RICSU,8,2018-05-06,Starenweg 5,Richter Supermarkt,Michael Holz,0897-034214,Switzerland
828,11076,BONAP,4,2018-05-06,"12, rue des Bouchers",Bon app',Laurence Lebihan,91.24.45.40,France
829,11077,RATTC,1,2018-05-06,2817 Milton Dr.,Rattlesnake Canyon Grocery,Paula Wilson,(505) 555-5939,USA

In [43]:
order_customer.describe()

            OrderID  EmployeeID
count    830.000000  830.000000
mean   10662.500000    4.403614
std      239.744656    2.499648
min    10248.000000    1.000000
25%    10455.250000    2.000000
50%    10662.500000    4.000000
75%    10869.750000    7.000000
max    11077.000000    9.000000

In [44]:
order_customer_country1 = order_customer['Country'].value_counts()

In [45]:
order_customer_country1.describe()

count     21.000000
mean      39.523810
std       34.178384
min        6.000000
25%       18.000000
50%       28.000000
75%       46.000000
max      122.000000
Name: Country, dtype: float64

In [46]:
order_customer_country2 = order_customer.groupby('Country').count()
order_customer_country2

,OrderID,CustomerID,EmployeeID,OrderDate,ShipAddress,CompanyName,ContactName,Phone
Country,,,,,,,,
Argentina,16,16,16,16,16,16,16,16
Austria,40,40,40,40,40,40,40,40
Belgium,19,19,19,19,19,19,19,19
Brazil,83,83,83,83,83,83,83,83
Canada,30,30,30,30,30,30,30,30
Denmark,18,18,18,18,18,18,18,18
Finland,22,22,22,22,22,22,22,22
France,77,77,77,77,77,77,77,77
Germany,122,122,122,122,122,122,122,122
Ireland,19,19,19,19,19,19,19,19
Italy,28,28,28,28,28,28,28,28
Mexico,28,28,28,28,28,28,28,28
Norway,6,6,6,6,6,6,6,6
Poland,7,7,7,7,7,7,7,7
Portugal,13,13,13,13,13,13,13,13
Spain,23,23,23,23,23,23,23,23
Sweden,37,37,37,37,37,37,37,37
Switzerland,18,18,18,18,18,18,18,18
UK,56,56,56,56,56,56,56,56
USA,122,122,122,122,122,122,122,122
Venezuela,46,46,46,46,46,46,46,46

In [47]:
order_customer_country2.rename(columns={'OrderID': 'Number of Orders'}, inplace=True)
order_customer_country2

,Number of Orders,CustomerID,EmployeeID,OrderDate,ShipAddress,CompanyName,ContactName,Phone
Country,,,,,,,,
Argentina,16,16,16,16,16,16,16,16
Austria,40,40,40,40,40,40,40,40
Belgium,19,19,19,19,19,19,19,19
Brazil,83,83,83,83,83,83,83,83
Canada,30,30,30,30,30,30,30,30
Denmark,18,18,18,18,18,18,18,18
Finland,22,22,22,22,22,22,22,22
France,77,77,77,77,77,77,77,77
Germany,122,122,122,122,122,122,122,122
Ireland,19,19,19,19,19,19,19,19
Italy,28,28,28,28,28,28,28,28
Mexico,28,28,28,28,28,28,28,28
Norway,6,6,6,6,6,6,6,6
Poland,7,7,7,7,7,7,7,7
Portugal,13,13,13,13,13,13,13,13
Spain,23,23,23,23,23,23,23,23
Sweden,37,37,37,37,37,37,37,37
Switzerland,18,18,18,18,18,18,18,18
UK,56,56,56,56,56,56,56,56
USA,122,122,122,122,122,122,122,122
Venezuela,46,46,46,46,46,46,46,46

In [48]:
order_customer_country2[['Number of Orders']]

             Number of Orders
Country
Argentina                  16
Austria                    40
Belgium                    19
Brazil                     83
Canada                     30
Denmark                    18
Finland                    22
France                     77
Germany                   122
Ireland                    19
Italy                      28
Mexico                     28
Norway                      6
Poland                      7
Portugal                   13
Spain                      23
Sweden                     37
Switzerland                18
UK                         56
USA                       122
Venezuela                  46

In [49]:
order_customer_country2[['Number of Orders']].describe()

       Number of Orders
count         21.000000
mean          39.523810
std           34.178384
min            6.000000
25%           18.000000
50%           28.000000
75%           46.000000
max          122.000000